infrastructure/testing/integration/src/test/resources/map/request-getlayers.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:tns="http://servicemix.apache.org/samples/wsdl-first/types">
  <env:Body>
    <map:GetLayersRequest xmlns:map="http://uicds.org/MapService">
        <map:incidentId>test</map:incidentId>        
    </map:GetLayersRequest>
  </env:Body>
</env:Envelope>